# _*_ coding : utf-8_*_
# @Time  : 2023-06-19 16:41
# @Author : 广东工业大学 王红胜
# @File : huatu 
# @Project : 人脸模式识别

import matplotlib.pyplot as plt

# 定义数据
x = [2, 5, 7, 9, 11, 13, 15, 20, 30]
y = [0.6100427257129055, 0.6541241762102377, 0.6583757390974307, 0.6611232328317665, 0.6613738586139943, 0.6691341942152, 0.6698819969197085, 0.6681360699935069,0.6578707304870437]

# 绘制折线图
plt.plot(x, y)

# 添加横纵坐标标签
#plt.xlabel('K_value')
#plt.ylabel('Accuracy')

# 添加标题
#plt.title('Line Plot')

# 显示图形
#plt.show()
